

▎Слишком древний шифр

▎Описание

Вы отправились в путешествие на необитаемый остров и попали в ловушку местного племени. Чтобы выбраться, вам нужно разгадать загадку, связанную с кратностью чисел. На воротах ловушки находятся два поля для чисел: первое поле содержит случайное число от 3 до 20, а второе должно содержать пароль, состоящий из пар чисел, сумма которых делит это число без остатка.

▎Задача

Напишите программу, которая будет генерировать пароль для заданного числа n (от 3 до 20). Пароль должен состоять из уникальных пар чисел, которые суммируются и делят n без остатка.

▎Примеры

- Для n = 9, правильный пароль: 1218273645
- Для n = 11, правильный пароль: 11029384756

▎Условия

1. Пары чисел формируются из диапазона от 1 до 20.
2. Первое число не входит в одно из чисел пары.
3. Все пары должны быть уникальными.

▎Алгоритм

1. Получить значение n.
2. Сформировать все возможные пары чисел от 1 до 20.
3. Проверить, делится ли n на сумму каждой пары.
4. Сформировать строку паролей на основе найденных пар.

▎Пример кода

def generate_password(n):
    password = ""
    pairs = []

    for i in range(1, 21):
        for j in range(i + 1, 21):
            if (i + j) > n and n % (i + j) == 0:
                pairs.append(f"{i}{j}")

    password = ''.join(pairs)
    return password

# Пример использования
n = 9
print(generate_password(n))  # Вывод: 1218273645


▎Тестирование

Для проверки правильности работы программы можно использовать заранее известные пароли для чисел от 3 до 20.

▎Список паролей

| n  | Пароль                |
|----|-----------------------|
| 3  | 12                    |
| 4  | 13                    |
| 5  | 1423                  |
| 6  | 121524                |
| 7  | 162534                |
| 8  | 13172635              |
| 9  | 1218273645            |
| 10 | 141923283746          |
| 11 | 11029384756           |
| 12 | 12131511124210394857  |
| 13 | 112211310495867       |
| 14 | ...                   |

▎Установка

1. Склонируйте репозиторий:

   git clone https://github.com/pon4ick-lovely/Code_password.git

2. Перейдите в директорию проекта:

   cd Code_password

3. Запустите скрипт:

   python main.py
